app/controllers/activities_controller.rb

  def create

    @activity = Activity.new(activity_params)
    @activity.creator = current_user

    respond_to do |format|
      if @activity.save
---
INSERT INTO "activities" ("activity_name", "description", "location", "date", "start_time", "duration", "number_of_places", "status", "active", "image", "places_taken", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"

  def book
    activity = Activity.find(params[:id])
---
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]