app/controllers/membership_types_controller.rb

  def index
    @membership_types = MembershipType.all
---
SELECT "membership_types".* FROM "membership_types"

  def create
    @membership_type = MembershipType.new(membership_type_params)

    respond_to do |format|
      if @membership_type.save
---
INSERT INTO "membership_types" ("image", "title", "description", "date_valid_from", "date_valid_to", "active", "price", "age_eligibility_lower", "age_eligibility_upper", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

    def set_membership_type
      @membership_type = MembershipType.find(params[:id])
---
SELECT  "membership_types".* FROM "membership_types" WHERE "membership_types"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]