app/controllers/messages_controller.rb

  def index
    @messages = @conversation.messages

    #set all undread messages from the other user to true
    @messages.where("user_id != ? AND read = ?", current_user.id, false).update_all(read: true)
---
SELECT  "messages".* FROM "messages" WHERE "messages"."conversation_id" = $1 ORDER BY "messages"."id" DESC LIMIT $2  [["conversation_id", 1], ["LIMIT", 1]]
UPDATE "messages" SET "read" = $1, "updated_at" = $2 WHERE "messages"."id" = $3  [["read", true], ["updated_at", 2016-08-08 13:35:35 UTC], ["id", 3]]

  def create
    @message = @conversation.messages.new(message_params)
    @message.user = current_user

    if @message.save
---
INSERT INTO "messages" ("body", "conversation_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Hi Jules"], ["conversation_id", 1], ["user_id", 3], ["created_at", 2016-08-08 13:33:30 UTC], ["updated_at", 2016-08-08 13:33:30 UTC]]